package org.ysnam.householdAccounts.core.model;

import lombok.Getter;

@Getter
public enum MerchantType {
    외식("맥도날드|배달통|성심당|맘스터치|오떡순|딸기슈퍼|파리바게트|진로집|카페인중독|호식이두마리|" +
         "만년닭강정|피자스쿨|젤라또베어|아오리의행방|버거킹|파파존스|홍반점|프셔니스트|치킨돌|라면|공차|" +
         "커피빈|양꼬치|국수|족발|카페|고기|아이스크림|세계로|롯데리|계림원|노랑통닭|더후라이팬|" +
         "멋진한끼|모노치즈|미나리|봉선마라탕|불닭|닭갈비|투썸|대성농장|큐슈라멘|착한피자|순수치킨|" +
         "키다리식품|아웃백|장타이펑|이차돌|스타벅|우마이|모스버거|쉐이크|김밥나라|신가원|더블트러블|" +
         "헬로우잇쯔미|미투글로벌|Paulies|페이게이트"),
    마트("이마트가든|신세계|마트|노브랜드|플러스할인|한무쇼|제일정육|사실주의베이"),
    물건("아셈하비|현대철물|다비치안경|아비드안경|더샘|\\(유\\)남원볼"),
    소액결제("갤럭시아컴즈"),
    백화점("현대백"),
    병원비("내과|명의마취통증|휴엘재활"),
    교통_시내("\\(주\\)이비카"),
    교통_시외("한국철도|티머니고속|고속버스|시외버스"),
    교통_택시("택시"),
    편의점("GS|이마트24|씨유|코레일유통|제일소비자|지에스|이니시스|미니스톱|서브웨이|세븐일레븐|씨제이올리브"),
    입금("xxxxxxxxx"),
    월급("월급"),
    가스요금("가스"),
    전기요금("전기"),
    수도요금("수도"),
    주민세("서울\\(주민"),
    관리비("01235612947"),
    주택청약("816907\\*\\*79"),
    보험료("교보18[0-9][0-9]-000"),
    생활용품("G마켓|옥션|네이버|롯데쇼핑|쿠팡|11번가"),
    해외승인("마스터해외|마스타해외|비자해외승인"),
    데이트("대전마케팅|중구효문화|장프로포켓|주식회사애니|롯데컬처웍스|롯데시네마|게임이너스|로얄볼링센타|미녀와야수"),
    주식("키움증권"),
    페이("카카오페이|코나머니|kakao|카뱅"),
    이체("신한남유선"),
    용돈("08811037724|08811048387"),
    운동("삼모스포츠|삼모흥업"),
    수수료("월입출통"),
    카드값("신한카드"),
    카드사용료("KB카드출금"),
    현금("제휴CD출금"),
    의료비("치과|약국");

    final String filter;

    MerchantType(String filter){
        this.filter = filter;
    }
}
